{
  "main": {
    "name": "Chethan Mysuru Radhakrishna",
    "description": "Pursuing Master's in Data and Knowledge Engineering | Web Developer",
    "image": "chethan.jpg",
    "bio": "I am a data science enthusiast with an inclination towards visual exploration of trends in data. I am also a skilled web developer with a collective experience of 4.5 years. However, I believe in the idea that \"What we know is a drop and what we don’t know is an ocean\".",
    "contactmessage": "Feel free to contact me!",
    "email": "chethanmr.2694@gmail.com",
    "phone": "+49 176-3681-7295",
    "github": "https://github.com/chethanMysore",
    "project": "https://www.linkedin.com/in/chethan-radhakrishna-94310010b/",
    "address": {
      "street": "Wallonerberg 4",
      "city": "Magdeburg",
      "state": "Germany",
      "zip": "39104"
    },
    "website": "",
    "resumedownload": "CV3.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/chethan-radhakrishna-94310010b/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/chethanMysore",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I have been using react.js, bootstrap, CSS, HTML, SQL, C# and ASP .NET Web API's for the last 4.5 years and I am confident in these technologies (.NET-react stack). Lately, I have been working on reSolve, a full stack javascript framework built on node.js, CQRS and Domain Driven Design. I am a quick learner and I have been learning R and Python since 2019 and I have worked on a scientific team project where I developed R API's to dynamically visualize trends in data along with a react.js dashboard.",
    "education": [
      {
        "school": "Otto-von-Guericke University, Magdeburg",
        "degree": "M.Sc. in Data and Knowledge Engineering",
        "graduated": "2019 – Ongoing",
        "description": "I have been keen on learning fundamentals of data science and have completed courses like Machine Learning, Data Mining, Visual Analytics, Introduction to Deep Learning, Digital Humanities and Knwoledge Engineering. I have also done several data management courses like Distributed Data Management, Data Management for Engineering Applications, Advanced Data Models"
      },
      {
        "school": "Vidyavardhaka College of Engineering, India",
        "degree": "B.E. in Computer Science and Engineering",
        "graduated": "2012 – 2016",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "Bosch Engineering Gmbh",
        "title": "Big Data Analyst Intern",
        "years": "April 2021 – September 2021",
        "description": "Worked as an intern on big-data analysis in project management metrics. Created complex data preparation and wrangling queries and interactive dashboard visualizations in Splunk Enterprise tool. These visualizations are used every day by various levels of management to track and analyse the progress of several ongoing projects at Bosch Engineering both in Germany and in the US. Also, worked on automatic dashboard deployment scripts in python."
      },
      {
        "company": "Metratec Gmbh",
        "title": "Software Developer - Student Job",
        "years": "June 2019 – February 2021",
        "description": "Working as a full stack web developer. Handled API integration with react-redux dashboards. worked on real time data using web sockets. worked on event sourcing and reSolve(a CQRS framework built using node.js). Managed Gitlab pipeline and docker configurations with yaml."
      },
      {
        "company": "Happiest Minds Technologies Pvt Ltd",
        "title": "Software Engineer",
        "years": "October 2016 – January 2019",
        "description": "Contributed as a full stack web developer. Worked on ASP.NET MVC applications and Web API services built on .NET framework 4.6.2 and .NET core. Worked on react.js and redux to implement stateful frontend designs. Worked exclusively on Health Care domain with the knowledge of online data exchange standards such as HL7. Worked on AWS EC2, S3 buckets, Simple Mail Service and Lambda(for deploying micro services). As a billable resource, interacted with clients to understand requirements and effectively communicated the innovative ideas to solve their problems."
      }
    ],
    "skills": [
      {
        "name": "R",
        "level": "70%"
      },
      {
        "name": "Python",
        "level": "60%"
      },
      {
        "name": "ReactJs",
        "level": "80%"
      },
      {
        "name": "C#",
        "level": "80%"
      },
      {
        "name": "SQL",
        "level": "80%"
      },
      {
        "name": "mongoDB",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Small Vessel Segmentation using Deformation-aware Semi-supervised learning",
        "category": "Application of DS6 Deformation-aware Semi-supervised learning published by Soumick Chatterjee et.al., to 7T MRA images and improvement of segmentation quality by Max Intensity Projection (MIP) comparisons.",
        "image": "UNET-MSS.png",
        "url": "https://arxiv.org/abs/2006.10802"
      },
      {
        "title": "Ship Study Dashboard",
        "category": "A visual exploration tool to describe results produced by machine learning model(RuleFit). The tool aims at interactively exploring the correlations between selected features. The tool also displays critical factors influencing the diagnosis of Hepatic Steatosis(Fatty Liver Disorder).",
        "image": "Feature_Explanations.png",
        "url": "https://github.com/chethanMysore/ship-study-ui"
      },
      {
        "title": "Ship Study API",
        "category": "ShipCohortStudy is a project aimed at using Interpretable Machine Learning to understand participant evolution in longitudinal cohort study data. ShipStudyApi is a restful service that exposes http endpoints to visualize the results of rulefit model built on SHIP dataset. Additionally, evoxploit package is used to augment the dataset with evolutionary features (Niemann et al., 2015) and rules extracted from building random forest on the dataset (Friedman et al., 2008). The feature selection is then performed using Least Absolute Shrinkage and Selection Operator(LASSO) to obtain minimal set of important features (Friedman et al., 2009). The api caters to a visualization dashboard that explores the model results dynamically and interactively.",
        "image": "ship-study-api.png",
        "url": "https://github.com/chethanMysore/ship-cohort-study"
      },
      {
        "title": "Information Retrieval System",
        "category": "This is a console java application which indexes files and directories and allows users to execute boolean queries on them. Here we used Apache Lucene to tokenize, index and query text in a directory(nested) or files. The application aims at achieving disambiguation of search terms and ranking of results based on relevance score.",
        "image": "ir.png",
        "url": "https://github.com/chethanMysore/info-retrieval-system"
      },
      {
        "title": "Gesture Recognition App",
        "category": "An interactive WPF application to recognize hand gestures made by authorized users who are authenticated using face recognition.",
        "image": "gesture1.png",
        "url": "https://github.com/chethanMysore/Kinect.GestureRecognitionAppV2"
      },
      {
        "title": "Resource Management Dashboard",
        "category": "This is a dashboard for Resource Manager. The application is written in reactjs with redux as state manager. The dashboard is styled with bootstrap and some custom css. The dashboard consumes API's exposed by node-backend.",
        "image": "react-dashboard.png",
        "url": "https://github.com/chethanMysore/react-front-end"
      },
      {
        "title": "Resource Management API",
        "category": "A node js API for performing crud operations on a database in mongoDB.",
        "image": "node-backend.png",
        "url": "https://github.com/chethanMysore/node-backend"
      }
    ]
  }
}
